Enums/упКартинкиМаркеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упКартинкиМаркеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыбратьИзФайла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПоУмолчанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерГолубой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЖелтый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЗеленый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерКрасный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСиний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерФиолетовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойБелый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойГолубой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЖелтый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЗеленый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойКрасный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойОранжевый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойРозовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСерый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСиний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойФиолетовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЧерный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПоУмолчаниюВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерГолубойВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЖелтыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЗеленыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерКрасныйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСинийВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерФиолетовыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойБелыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойГолубойВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЖелтыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЗеленыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойКрасныйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойОранжевыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойРозовыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСерыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСинийВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойФиолетовыйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЧерныйВыделенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПоУмолчаниюВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерГолубойВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЖелтыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерЗеленыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерКрасныйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСинийВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерФиолетовыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойБелыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойГолубойВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЖелтыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЗеленыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойКрасныйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойОранжевыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойРозовыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСерыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойСинийВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойФиолетовыйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПростойЧерныйВыбранный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерПрибытиеВТочкуМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерНачалоРаботВТочкеМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерУбытиеСТочкиМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСообщениеДиспетчеру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерСообщениеОтДиспетчера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерИсходящийЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерВходящийЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерТочкаПропущена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортноеСредство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобытиеМониторинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерИзменениеСледующейТочкиПоМаршруту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркерОтсутствиеЛицензииНаПодключение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КроссДокинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Магазин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Склад</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/упРаботаСКартамиКлиентСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция находит соответствие в библиотеке картинок перечислению.
//
// Параметры:
//  КартинкаСсылка - ПеречислениеСсылка.упКартинкиМаркеров - Картинка.
//
// Возвращаемое значение:
//  БиблиотекаКартинок - Элемент библиотеки картинок.
//
Функция ПолучитьКартинку(КартинкаСсылка) Экспорт
	
	Если КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПоУмолчанию") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПоУмолчанию;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерГолубой") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерГолубой;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерЖелтый") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерЖелтый;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерЗеленый") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерЗеленый;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерКрасный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерКрасный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерСиний") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерСиний;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерФиолетовый") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерФиолетовый;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойБелый") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойБелый;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойГолубой") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойГолубой;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойЖелтый") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойЖелтый;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойЗеленый") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойЗеленый;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойКрасный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойКрасный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойОранжевый") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойОранжевый;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойРозовый") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойРозовый;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойСерый") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойСерый;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойСиний") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойСиний;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойФиолетовый") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойФиолетовый;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойЧерный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойЧерный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПоУмолчаниюВыбранный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПоУмолчаниюВыбранный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерГолубойВыбранный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерГолубойВыбранный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерЖелтыйВыбранный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерЖелтыйВыбранный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерЗеленыйВыбранный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерЗеленыйВыбранный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерКрасныйВыбранный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерКрасныйВыбранный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерСинийВыбранный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерСинийВыбранный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерФиолетовыйВыбранный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерФиолетовыйВыбранный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойБелыйВыбранный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойБелыйВыбранный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойГолубойВыбранный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойГолубойВыбранный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойЖелтыйВыбранный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойЖелтыйВыбранный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойЗеленыйВыбранный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойЗеленыйВыбранный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойКрасныйВыбранный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойКрасныйВыбранный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойОранжевыйВыбранный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойОранжевыйВыбранный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойРозовыйВыбранный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойРозовыйВыбранный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойСерыйВыбранный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойСерыйВыбранный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойСинийВыбранный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойСинийВыбранный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойФиолетовыйВыбранный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойФиолетовыйВыбранный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойЧерныйВыбранный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойЧерныйВыбранный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПоУмолчаниюВыделенный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПоУмолчаниюВыделенный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерГолубойВыделенный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерГолубойВыделенный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерЖелтыйВыделенный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерЖелтыйВыделенный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерЗеленыйВыделенный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерЗеленыйВыделенный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерКрасныйВыделенный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерКрасныйВыделенный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерСинийВыделенный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерСинийВыделенный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерФиолетовыйВыделенный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерФиолетовыйВыделенный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойБелыйВыделенный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойБелыйВыделенный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойГолубойВыделенный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойГолубойВыделенный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойЖелтыйВыделенный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойЖелтыйВыделенный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойЗеленыйВыделенный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойЗеленыйВыделенный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойКрасныйВыделенный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойКрасныйВыделенный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойОранжевыйВыделенный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойОранжевыйВыделенный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойРозовыйВыделенный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойРозовыйВыделенный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойСерыйВыделенный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойСерыйВыделенный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойСинийВыделенный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойСинийВыделенный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойФиолетовыйВыделенный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойФиолетовыйВыделенный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПростойЧерныйВыделенный") Тогда 
		Картинка = БиблиотекаКартинок.упМаркерПростойЧерныйВыделенный;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерПрибытиеВТочкуМаршрута") Тогда 
		Картинка = БиблиотекаКартинок.упПрибытиеНаТочку;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерНачалоРаботВТочкеМаршрута") Тогда 
		Картинка = БиблиотекаКартинок.упНачалоРаботНаТочке;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерУбытиеСТочкиМаршрута") Тогда 
		Картинка = БиблиотекаКартинок.упУбытиеСТочки;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерСообщениеДиспетчеру") Тогда 
		Картинка = БиблиотекаКартинок.упСообщениеДиспетчеру;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерСообщениеОтДиспетчера") Тогда 
		Картинка = БиблиотекаКартинок.упСообщениеОтДиспетчера;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерВходящийЗвонок") Тогда 
		Картинка = БиблиотекаКартинок.упВходящийЗвонок;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерИсходящийЗвонок") Тогда 
		Картинка = БиблиотекаКартинок.упИсходящийЗвонок;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерТочкаПропущена") Тогда 
		Картинка = БиблиотекаКартинок.Предупреждение;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.ТранспортноеСредство") Тогда 
		Картинка = БиблиотекаКартинок.упТС;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.СобытиеМониторинга") Тогда 
		Картинка = БиблиотекаКартинок.Информация;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерИзменениеСледующейТочкиПоМаршруту") Тогда 
		Картинка = БиблиотекаКартинок.Изменить;	
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.МаркерОтсутствиеЛицензииНаПодключение") Тогда 
		Картинка = БиблиотекаКартинок.упЛицензияОтсутствует;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.Поставщик") Тогда 
		Картинка = БиблиотекаКартинок.упПоставщик;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.КроссДокинг") Тогда 
		Картинка = БиблиотекаКартинок.упКроссДокинг;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.Склад") Тогда 
		Картинка = БиблиотекаКартинок.упСклад;
	ИначеЕсли КартинкаСсылка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.Магазин") Тогда 
		Картинка = БиблиотекаКартинок.упМагазин;	
	Иначе
		Картинка = Неопределено;
	КонецЕсли;	
	
	Возврат Картинка;
	
КонецФункции // ПолучитьКартинку()

// Функция возвращает расстояние между точками по прямой.
//
// Параметры:
//   StartLat - Число - начальные Широта.
//   StartLong - Число - начальные Долгота.
//   EndLat - Число - конечные Широта.
//   EndLong - Число - конечные Долгота.
//
// Возвращаемое значение:
//  Число - Расстояние.
//
Функция ПолучитьРасстояниеМеждуТочками(StartLat, StartLong, EndLat, EndLong) Экспорт
	
	Если StartLat = EndLat И StartLong = EndLong Тогда
		Возврат 0;	
	КонецЕсли;
	
	// Константы, используемые для вычисления смещения и расстояния.
	Pi=3.1415926535897932;
	D2R = Pi/180; // Константа для преобразования градусов в радианы.
	R2D = 180/Pi; // Константа для преобразования радиан в градусы.
	a = 6378137.0; // Основные полуоси.
	b = 6356752.314245; // Неосновные полуоси.
	e2 = 0.006739496742337; // Квадрат эксцентричности эллипсоида.
	f = 0.003352810664747; // Выравнивание эллипсоида.
	
	// Вычисляем разницу между двумя долготами и широтами и получаем среднюю широту.
	fdLambda = (StartLong - EndLong) * D2R;
	fdPhi = (StartLat - EndLat) * D2R;
	fPhimean = ((StartLat + EndLat) / 2.0) * D2R;
	
	// Вычисляем меридианные и поперечные радиусы кривизны средней широты.
	fTemp = 1 - e2 * (Pow(Sin(fPhimean), 2));
	fRho = (a * (1 - e2)) / Pow(fTemp, 1.5);
	fNu = a / (Sqrt(1 - e2 * (Sin(fPhimean) * Sin(fPhimean))));
	
	// Вычисляем угловое расстояние.
	fz = Sqrt(Pow(Sin(fdPhi / 2.0), 2) + Cos(EndLat * D2R) * Cos(StartLat * D2R) * Pow(Sin(fdLambda / 2.0), 2));
	
	fz = 2 * ASin(fz);
	
	// Вычисляем смещение.
	fAlpha = Cos(EndLat * D2R) * Sin(fdLambda) * 1 / Sin(fz);
	fAlpha = ASin(МАКС(МИН(Окр(fAlpha,12),1),-1));
	
	// Вычисляем радиус Земли.
	fR = (fRho * fNu) / ((fRho * Pow(Sin(fAlpha), 2)) + (fNu * Pow(Cos(fAlpha), 2)));
	
	// Получаем расстояние.
	Distance = (fz * fR);
	
	Возврат Distance;
					
КонецФункции // ПолучитьРасстояниеМеждуТочками()

&НаКлиенте
// Функция возвращает индекс по шагам маршрута рейса.
//
// Параметры:
//   ЭтаФорма - УправляемаяФорма - Форма объекта.
//   мсвРейсы - Массивы - Массив ссылок.
//   спзИндексыРейсов - СписокЗначений - Список индексов.
//   ТипыМаршрута - Строка - Тип маршрута.
//
// Возвращаемое значение:
//  Число - индекс рейса.
//
Функция ОтобразитьРейсы(ЭтаФорма, мсвРейсы, спзИндексыРейсов, ТипыМаршрута = "Факт") Экспорт
	
	// Очистить карту от предыдущих маршрутов.
	Для каждого текЭлемент Из спзИндексыРейсов Цикл
	
		УдалитьМаршрут(ЭтаФорма, текЭлемент.Значение);	
	
	КонецЦикла;
		
	спзИндексыРейсов.Очистить();
	
	// Построить новые маршруты.
	Шаг = 0;
	
	мсвШагиМаршрутовРейсов = упРейсВызовСервера.ПолучитьШагиМаршрутовРейсов(мсвРейсы, ТипыМаршрута);
	
	ЦветовыеСхемы = упРаботаСКартами.ПолучитьЦветовыеСхемы();
	
	Для каждого текОписаниеРейса Из мсвШагиМаршрутовРейсов Цикл
		
		текРейс = текОписаниеРейса.Рейс;
		мсвШагиМаршрута = текОписаниеРейса.ШагиМаршрута;
		текМаршрут = "";
		
		Для каждого текШагМаршрута Из мсвШагиМаршрута Цикл
			
			текМаршрут = текМаршрут + ПредставлениеШагаМаршрута(текШагМаршрута.НачальнаяТочкаШирота,
			текШагМаршрута.НачальнаяТочкаДолгота,
			текШагМаршрута.КонечнаяТочкаШирота,
			текШагМаршрута.КонечнаяТочкаДолгота,
			текШагМаршрута.Путь);
			
		КонецЦикла;
		
		текМаршрут = Лев(текМаршрут, СтрДлина(текМаршрут) - 2);
		
		текИндексРейса = ОтобразитьМаршрут(ЭтаФорма, текМаршрут, ПолучитьЦветовуюСхемуПоИндексу(Шаг, ЦветовыеСхемы));	
		спзИндексыРейсов.Добавить(текИндексРейса);
		
		Шаг = Шаг + 1;
		
	КонецЦикла;
		
	Возврат текИндексРейса;
	
КонецФункции

&НаКлиенте
// Функция возвращает индекс маршрута.
//
// Параметры:
//   Форма - УправляемаяФорма - Форма объекта.
//   КоординатыЛиний - Строка - Строковое представление координат.
//   ДанныеЛиний - Строка - Строковое представление данных линии толшина, цвет и прочее.
//
// Возвращаемое значение:
//  Число - индекс объекта линии в массиве.
//
Функция ОтобразитьМаршрут(Форма, КоординатыЛиний, ДанныеЛиний)

	Индекс = ВыполнитьФункциюHTML(Форма, "addTrip(""" + КоординатыЛиний + """, """ + ДанныеЛиний.Цвет + """, "
	                                           + ПредставлениеЧисла(ДанныеЛиний.Толщина) + ", " + ПредставлениеЧисла(ДанныеЛиний.Прозрачность) + ")");
	Возврат Индекс;										   
	
КонецФункции // ОтобразитьМаршрут()

&НаКлиенте
// Удаление маршрута с карты.
//
// Параметры:
//   Форма - УправляемаяФорма - Форма объекта.
//   ИндексМаршрута - Число - индекс объекта линии в массиве.
//
// Возвращаемое значение:
//  Нет.
//
Функция УдалитьМаршрут(Форма, ИндексМаршрута)

	ВыполнитьПроцедуруHTML(Форма, "deleteTrip(" + ПредставлениеЧисла(ИндексМаршрута) + ")");	

КонецФункции // УдалитьМаршрут()

// Возвращает типовую структуру иницииализации макета.
//
// Параметры:
//   ТекстHTMLМакета - Строка - Текст исполнения.
//   УникальныйИдентификаторФормы - Строка - Идентификатор.
//
// Возвращаемое значение:
//  Строка - Текст HTML макета, дополнен данными.
//
Функция ИнициализацияМакетаЗначениямиПоУмолчанию(ТекстHTMLМакета, УникальныйИдентификаторФормы = "") Экспорт

	НачальнаяШирота  = 55.84128;
	НачальнаяДолгота = 37.6495;
	НачальныйЗум     = 12;

	ТекстHTMLМакета = СтрЗаменить(ТекстHTMLМакета, "%Широта%", ПредставлениеЧисла(НачальнаяШирота));
	ТекстHTMLМакета = СтрЗаменить(ТекстHTMLМакета, "%Долгота%", ПредставлениеЧисла(НачальнаяДолгота));
	ТекстHTMLМакета = СтрЗаменить(ТекстHTMLМакета, "%Увеличение%", ПредставлениеЧисла(НачальныйЗум));	
	
	сткКартинок = Новый Структура();
	сткКартинок.Вставить("упМаркерПростойБелый", 	Новый Структура("Картинка, ДвоичныеДанные", БиблиотекаКартинок.упМаркерПростойБелый, Неопределено));
	сткКартинок.Вставить("упМаркерПростойЖелтый", 	Новый Структура("Картинка, ДвоичныеДанные", БиблиотекаКартинок.упМаркерПростойЖелтый, Неопределено));
	сткКартинок.Вставить("упМаркерПростойКрасный", 	Новый Структура("Картинка, ДвоичныеДанные", БиблиотекаКартинок.упМаркерПростойКрасный, Неопределено));
	сткКартинок.Вставить("упГеокодируемыйМаркер", 	Новый Структура("Картинка, ДвоичныеДанные", БиблиотекаКартинок.упГеокодируемыйМаркер, Неопределено));
	сткКартинок.Вставить("упТумблер",           	Новый Структура("Картинка, ДвоичныеДанные", БиблиотекаКартинок.упТумблер, Неопределено));
	
	упСервисныеФункцииВызовСервера.ЗаполнитьДвоичныеДанныеКартинок(сткКартинок);
	
	ИмяВременногоФайла = ПоместитьВоВременноеХранилище(сткКартинок.упТумблер.ДвоичныеДанные, УникальныйИдентификаторФормы);
	ТекстHTMLМакета = СтрЗаменить(ТекстHTMLМакета, "%toggle%", ИмяВременногоФайла);
	
	ИмяВременногоФайла = ПоместитьВоВременноеХранилище(сткКартинок.упМаркерПростойБелый.ДвоичныеДанные, УникальныйИдентификаторФормы);
	ТекстHTMLМакета = СтрЗаменить(ТекстHTMLМакета, "%МаркерРедактируемогоУгла%", ИмяВременногоФайла);
	
	ИмяВременногоФайла = ПоместитьВоВременноеХранилище(сткКартинок.упМаркерПростойЖелтый.ДвоичныеДанные, УникальныйИдентификаторФормы);
	ТекстHTMLМакета = СтрЗаменить(ТекстHTMLМакета, "%МаркерПервогоУгла%", ИмяВременногоФайла);
	
	ИмяВременногоФайла = ПоместитьВоВременноеХранилище(сткКартинок.упМаркерПростойКрасный.ДвоичныеДанные, УникальныйИдентификаторФормы);
	ТекстHTMLМакета = СтрЗаменить(ТекстHTMLМакета, "%МаркерПоследнегоУгла%", ИмяВременногоФайла);
	
	ИмяВременногоФайла = ПоместитьВоВременноеХранилище(сткКартинок.упГеокодируемыйМаркер.ДвоичныеДанные, УникальныйИдентификаторФормы);
	ТекстHTMLМакета = СтрЗаменить(ТекстHTMLМакета, "%МаркерГеокодирования%", ИзменитьФорматВременногоФайла(ИмяВременногоФайла));

	Возврат ТекстHTMLМакета;
	
КонецФункции // ИнициализацияМакетаЗначениямиПоУмолчанию()

&НаКлиенте
// Заставляет HTML документ выполнить javascript.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма объекта.
//	текстСкрипта - строка - тектс на javascript.
// 
Процедура ВыполнитьПроцедуруHTML(Форма, текстСкрипта, СлужебныеЭлементыHtml = Неопределено)
	
	упРаботаСКартамиКлиент.ВыполнитьПроцедуруHTML(текстСкрипта, Форма, СлужебныеЭлементыHtml);
	
КонецПроцедуры

&НаКлиенте
// Заставляет HTML документ выполнить javascript и возращает результат.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма объекта.
//	текстСкрипта - строка - тектс на javascript.
//
// Возвращаемое значение:
//	Строка - значение, которое возвращает javascript.
// 
Функция ВыполнитьФункциюHTML(Форма, текстСкрипта, СлужебныеЭлементыHtml = Неопределено)
	
	Возврат	упРаботаСКартамиКлиент.ВыполнитьФункциюHTML(текстСкрипта, Форма, СлужебныеЭлементыHtml);
	
КонецФункции

#КонецОбласти

#Область НаправленияДвижений

// Выполнить вычисление азимута между двумя географическими координатами.
//
// Параметры:
//  Широта1 - Число - Географическиая координата широты начала.
//  Долгота1 - Число - Географическиая координата долготы начала.
//  Широта2 - Число - Географическиая координата широты окончания.
//  Долгота2 - Число - Географическиая координата долготы окончания.
//
// Возвращаемое значение:
//	Число - Значения азимута географических координат.
// 
Функция ВычислитьНаправлениеДвижения(Широта1,Долгота1,Широта2,Долгота2)	Экспорт	
	
	Если Широта1 = Широта2 И Долгота1 = Долгота2 Тогда
		Возврат 0;
	КонецЕсли;
	
	Попытка
		
		// Константы, используемые для вычисления.
		Pi = 3.1415926535897932;
		
		ShiftDegrFin = 0; // Азимут прибытия.
		
		ms2 = 0; //магнитное склонение для второго поинта.
		
		D2R = Pi/180; // Константа для преобразования градусов в радианы.
		R2D = 180/Pi; // Константа для преобразования радиан в градусы.
		
		// Широта.
		LatToRad1 = Широта1 * D2R;
		LatToRad2 = Широта2 * D2R;
		
		// Долгота.
		LonToRad1 = Долгота1 * D2R;
		LonToRad2 = Долгота2 * D2R;
		
		c_Lat1 = Cos(LatToRad1);
		c_Lat2 = Cos(LatToRad2);
		
		s_Lat1 = Sin(LatToRad1);
		s_Lat2 = Sin(LatToRad2);
		
		delta = LonToRad2 - LonToRad1;	
		cdelta = Cos(delta);
		sdelta = Sin(delta);
		
		delta2 = LonToRad1 - LonToRad2;
		cdelta2 = Cos(delta2);
		sdelta2 = Sin(delta2);
		
		x = (c_Lat2*s_Lat1) - (s_Lat2*c_Lat1*cdelta2);
		y = sdelta2*c_Lat1;
		
		Если x = 0 Тогда
			z = 0;
		Иначе
			z = ATan(-y/x) * R2D; 
		КонецЕсли;		
		
		Если x < 0 Тогда
			z = z+180;
		КонецЕсли;		
		z2 = (z+180) % 360 - ShiftDegrFin;
		z2 = - ((z2+ms2) * D2R);
		
		Math_floor = ПолучитьMathFloor(z2/(2*Pi));
		anglerad2 = z2 - ((2*Pi)*Math_floor);
		angledeg_end = (anglerad2*180)/Pi;
		
	Исключение
		angledeg_end = 0;
	КонецПопытки;	
	
	Возврат angledeg_end;
	
КонецФункции // ВычислитьНаправлениеДвижения()

// Вычислить наибольшее целое число, которое меньше или равно заданному числу двойной точности с плавающей запятой.
//
// Параметры:
//  ТекущееЗначение - Число - Значение для преоборозования.
//
// Возвращаемое значение:
//	Число - возвращает наибольшее целое число, меньшее, либо равное указанному числу.
//
Функция ПолучитьMathFloor(ТекущееЗначение)
	
	// Math.floor( 45.95); //  45
	// Math.floor(-45.95); // -46
	// The example displays the following output to the console:
	//         Value          Floor.
	//       
	//          7.03              7;
	//          7.64              7;
	//          0.12              0;
	//         -0.12             -1;
	//          -7.1             -8;
	//          -7.6             -8;
	
	Результат = 0;
	
	Если НЕ ТекущееЗначение = 0 Тогда
		Результат = Окр(ТекущееЗначение-0.5,0,0);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПолучитьMathFloor()

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Функция ПредставлениеШагаМаршрута(ШиротаНачальная, ДолготаНачальная, ШиротаКонечная, ДолготаКонечная, Путь)

	текРезультат = "";
	
	Если ЗначениеЗаполнено(Путь) Тогда
		текРезультат = Путь + "//";
	ИначеЕсли ЗначениеЗаполнено(ШиротаНачальная) И ЗначениеЗаполнено(ДолготаНачальная) И ЗначениеЗаполнено(ШиротаКонечная) И ЗначениеЗаполнено(ДолготаКонечная) Тогда  
		текРезультат = ПредставлениеЧисла(ШиротаНачальная) + ";" + ПредставлениеЧисла(ДолготаНачальная) + ";" + ПредставлениеЧисла(ШиротаКонечная) + ";" + ПредставлениеЧисла(ДолготаКонечная) + ";" + "//";	
	КонецЕсли;

	Возврат текРезультат;
	
КонецФункции // ПредставлениеШагаМаршрута()

Функция ПолучитьЦветовуюСхемуПоИндексу(ТекущийНомер, ЦветовыеСхемы)

	текКоличествоСтрок = ЦветовыеСхемы.Количество();
	
	текНомерСхемы = ТекущийНомер % текКоличествоСтрок;
	
	Возврат ЦветовыеСхемы[текНомерСхемы];
	

КонецФункции // ПолучитьЦветовуюСхемуПоИндексу()

Функция	ИзменитьФорматВременногоФайла(Имя)
	
	Возврат "file://" + СтрЗаменить(Имя,"\","/");
	
КонецФункции // ИзменитьФорматВременногоФайла()

Функция ПредставлениеЧисла(Координата)
	
	Возврат Формат(Координата, "ЧРД=.; ЧН=; ЧГ=0");
	
КонецФункции // ПредставлениеЧисла()

#КонецОбласти
